Revit 2026 API

# DocumentDisplayUnitSystem Property

---

Provides access to display unit type with in the document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DisplayUnit DisplayUnitSystem { get; }
```
```vb
Public ReadOnly Property DisplayUnitSystem As DisplayUnit
	Get
```
```cpp
public:
property DisplayUnit DisplayUnitSystem {
	DisplayUnit get ();
}
```
```fsharp
member DisplayUnitSystem : DisplayUnit with get
```

#### Property Value

DisplayUnit

Return the display unit type, metric or imperial.

#### Reference

Document Class

Autodesk.Revit.DB Namespace